Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ཕོ་བྲང་དུ་གདུགས་ཚོད་ལན་མང་དུ་གསོལ་ནས་མིང་ནས་བརྗོད་དེ་ཡོན་བསྔོ་བ་མཛད་ན། འདི་ལྟ་བུའི་ཡོན་བསྔོ་བ་མཛད་པ་ནི་བདག་གིས་སྔོན་ཆད་ནི་ལན་འགའ་ཡང་མ་ཐོས་ལགས་སོ།
en: Thereupon the venerable Ānanda said to the Blessed One, “O Honored One, although the Blessed One has had meals at the palace of King Prasenajit of Kosala many times and assigned the rewards of the offerings, I have never heard him assign the rewards of the offerings in such a way in the past.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ནས་ཀྱི་དར་ཐུག་ལན་ཚྭས་མ་བཏབ་པ་ལ་བརྩམས་ཏེ་ལས་ཀྱི་རྒྱུ་བ་ཁྱོད་ཉན་པར་འདོད་དམ།
en: “Ānanda,” replied the Blessed One, “do you want to hear about the karmic bond related to King Prasenajit of Kosala’s saltless gruel?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ནས་ཀྱི་དར་ཐུག་ལན་ཚྭས་མ་སྩལ་བ་ལས་བརྩམས་ཏེ་ལས་ཀྱི་རྒྱུ་བ་བཤད་པ་བཅོམ་ལྡན་འདས་ལས་དགེ་སློང་རྣམས་ཀྱིས་ཐོས་ནས་འཛིན་པར་འགྱུར་ལགས་སོ།
en: If the Blessed One reveals the karmic bond related to King Prasenajit of Kosala’s saltless gruel, the monks will listen to it and grasp it.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་འོར་ཞིག་ན་ཁྱིམ་བདག་ཅིག་གནས་པ་དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད།
en: Then the Blessed One said to the monks, “Monks, there once lived a householder in a certain hamlet. He took a wife from a family of equal rank, and he and his wife played, made love, and enjoyed themselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་དོ། །དེ་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་བུ་གཟུགས་བཟང་བ་མཛེས་པ་བལྟ་ན་སྡུག་པ་ཞེས་བྱ་བ་ནས་བསྐྱེད་བསྲིངས་ཏེ་དེ་ཆེན་པོར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: Thus, a boy who was well proportioned, attractive, and pleasant to behold was born . . . and raised, and he grew up.

source: །ཇི་ཙམ་ན་ཁྱིམ་བདག་དེས་ཆུང་མ་ལ་སྨྲས་པ། བཟང་མོ་བདག་ཅག་གི་བུ་ལོན་དེད་པ་དང་། ནོར་འཕྲོག་པ་སྐྱེས་ཀྱིས་བདག་ཟོང་ཐོགས་ཏེ་ཡུལ་གཞན་དུ་འགྲོའོ།
en: “Thereupon the householder said to his wife, ‘Good lady, since a son who will bring us debts and deprive us of our property has been born to us, I will go abroad bearing merchandise.’

source: །དེས་སྨྲས་པ།
en: “ ‘My dear, please do so,’ she replied.

source: རྗེའི་སྲས་དེ་བཞིན་མཛོད་ཅིག །དེས་ཟོང་ཐོགས་ཏེ་ཡུལ་གཞན་ཞིག་ཏུ་སོང་བ་ལས་དེ་དེ་ཉིད་དུ་མ་སྟེས་ཏེ་ཤི་བར་གྱུར་ཏོ།
en: “He went abroad bearing merchandise, and, unfortunately, died there.

source: །དེ་ཆེད་པོ་མི་བདོག་པ་ཞིག་པས་དེའི་ཁྱིམ་གྱི་ནོར་རྣམས་ཟད་པས་དེའི་བུ་ཡང་སྡུག་བསྔལ་བར་གྱུར་པ་དང་། ཁྱིམ་བདག་དེའི་སྟེན་གྲོགས་ཤིག་ཡོད་པ་དེས་དེ་ལ་སྨྲས་པ། ཁྱེའུ་ཁོ་བོའི་ཞིང་ལས་དག་བྱོས་ཤིག་དང་ངས་ཁྱོད་ཀྱི་ཟན་སྦྱར་བར་བྱའོ།
en: Since his possessions were modest, his domestic property ran out, and his son suffered poverty. A friend of the householder said to him, ‘Son, work in my fields, and I will provide you with food.’

source: །དེས་དེའི་ཞིང་ལས་དག་བྱ་བར་བརྩམས་ནས་དེས་ཀྱང་དེའི་ཟན་སྦྱར་ཏོ།
en: “The son began to work in the man’s field, and the man provided him with food.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་དུས་སྟོན་ལ་བབ་ནས་ཁྱེའུ་དེའི་མས་བསམས་པ།
en: “Then, one day there was a festival.

source: དེང་ནི་ཁྱིམ་བདག་གི་ཆུང་མ་མཛའ་བཤེས་དང་གཉེན་དང་ཉེ་དུ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེའི་སྐྱེ་བོ་རྣམས་ཟན་སྦྱིན་པས་བྲེལ་བར་འགྱུར་གྱིས།
en: The boy’s mother thought, ‘Today the householder’s wife will be busy giving a meal to her friends, kinsmen, relatives, śramaṇas, and young brahmins.

source: སྔ་འཚོགས་སུ་སོང་ལ་ཁྱེའུ་དེའི་ཟན་བསྐྱལ་ལོ་སྙམ་ནས།
en: So I will go to her in advance to get my son’s meal.’

source: དེ་སྔ་འཚོགས་སུ་སོང་ནས་ཁྱིམ་བདག་གི་ཆུང་མ་ལ་དོན་དེ་དག་གོ་བར་བྱས་པ་དང་དེ་ཁྲོས་ནས་སྨྲས་པ།
en: “She went in advance to the wife of the householder and asked her for a meal.

source: རེ་ཞིག་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། ཉེ་དུ་རྣམས་ཀྱང་ད་དུང་མ་བྱིན་པར་མངག་གཞུག་པ་ཁྱེའུ་ལ་སྦྱིན་ནམ།
en: The wife became angry and said, ‘Why should I give a meal to a servant boy when I have not yet even given it to śramaṇas, brahmins, and relatives?

source: རེ་ཞིག་དེ་རིང་ནི་སྡོད་ཅིག །སང་ཉིས་འགྱུར་དུ་སྦྱིན་ནོ།
en: Wait all day; I will give you a double portion tomorrow.’

source: །དེ་ནས་ཁྱེའུ་དེའི་མས་བསམས་པ།
en: “Then the boy’s mother thought, ‘Perhaps my son has become hungry;

source: ཁྱེའུ་བཀྲེས་པར་མ་གྱུར་གྲང་སྙམ་ནས་བདག་ཉིད་ཀྱི་ནས་ཀྱི་ཟན་དྲོན་ལན་ཚྭས་མ་བཏབ་པ་འདི་བསྐྱལ་ལོ་སྙམ་མོ།
en: I will take him this saltless wheat gruel of mine.’

source: །དེས་དེ་ཁྱེར་ནས་ཞིང་ཐོག་ཏུ་སོང་བ་དང་ཁྱེའུ་དེས་དེ་རྒྱང་མི་རིང་བ་ཞིག་ནས་མཐོང་ནས་དེས་སྨྲས་པ།
en: “She then took it to the field.

source: ཡུམ་ཞིམ་པོ་ཅུང་ཟད་མ་མཆིས་སམ།
en: The boy saw her from a place nearby and asked, ‘Mother, is there not anything tasty?’

source: དེས་སྨྲས་པ། བུ་དེ་རིང་ནི་ཟན་ནར་མ་གང་ཡིན་པ་ཉིད་ཀྱང་མེད་དོ།
en: “ ‘Son,’ she said, ‘we do not have even an ordinary meal today.’

source: །ཡུམ་ཅི་སྟེ་ལགས།
en: “ ‘Why, mother?’

source: དེས་བུ་ལ་ཁྱིམ་བདག་གི་ཆུང་མ་ཇི་སྐད་དུ་ཟེར་བ་དེ་དག་ཐམས་ཅད་རྒྱས་པར་བསྙད་ནས་ཟན་དྲོན་ལན་ཚྭས་མ་བཏབ་པ་འདི་ཡང་ཁོ་མོ་ཉིད་ཀྱིས་ཁྱེར་ཏེ་འོངས་ཀྱིས།
en: “She explained to her son in detail all that the householder’s wife had said, and told him, ‘I brought this saltless wheat gruel.

source: བུ་འདི་ཟོ་ཤིག་ཅེས་སྨྲས་པ་དང་། དེས་སྨྲས་པ།
en: Son, please eat it.’ “ ‘Just leave it,’ he replied.

source: ཞོག་ལ་བཞུད་ཅིག །དེས་བཞག་སྟེ་སོང་ངོ་།
en: She left it and departed.

source: །སངས་རྒྱས་རྣམས་འབྱུང་བ་མེད་པ་ན་འཇིག་རྟེན་དུ་རང་སངས་རྒྱས་དམན་ཞིང་ངན་པ་ལ་སྙིང་བརྩེ་བ་ཅན། བས་མཐའི་གནས་མལ་ལ་དགའ་བ།
en: “When the buddhas do not appear, there appear self-awakened ones as the only ones worthy of veneration in the world, who are compassionate toward inferior, wretched people and content with places to sit on the outskirts of towns.

source: འཇིག་རྟེན་གྱི་ཡོན་གནས་གཅིག་པུ་དག་འབྱུང་བར་འགྱུར་བས་ཇི་ཙམ་ན་རང་སངས་རྒྱས་ཤིག་ཕྱོགས་དེར་ཕྱིན་པ་དང་། དེས་དེ་ལུས་མཛེས་པ་དང་། སེམས་དང་བ་དང་། སྤྱོད་ལམ་ཞི་བར་མཐོང་ནས་དེས་བསམས་པ།
en: “At that time, a certain self-awakened one arrived at that place. The boy saw him whose body was beautiful, whose mind was pure, and whose behavior was calm, and thought, ‘Certainly I have not performed any service for such a one so worthy of veneration in the past;

source: གདོན་མི་ཟ་བར་བདག་གིས་ཡོན་གནས་ཡང་དག་པ་འདི་ལྟ་བུ་ལ་བྱ་བ་མ་བྱས་པ་དེས་ན་བདག་འདི་འདྲ་བའི་གནས་སྐབས་སུ་གྱུར་གྱིས།
en: because of that, I am now in this circumstance.

source: གལ་ཏེ་བདག་ལས་ཟན་དྲོན་ལན་ཚྭས་མ་བཏབ་པ་འདི་བཞེས་ན་བདག་གིས་དེ་ལ་དབུལ་བར་བྱའོ་སྙམ་པ་དང་། དེ་ནས་རང་སངས་རྒྱས་དེས་སྐྱེས་བུ་བཀྲེན་པ་དེའི་བསམ་པ་སེམས་ཀྱིས་ཤེས་ནས་ལྷུང་བཟེད་བཟེད་དེ།
en: If he accepts this saltless gruel from me, I will offer it to him.’

source: བཞིན་བཟངས་གལ་ཏེ་ཁྱོད་ཀྱིས་བཏང་བ་ཡིན་ན་ལྷུང་བཟེད་འདིར་ཆུག་ཤིག །དེ་ནས་དེས་དད་པ་དྲག་པོས་ཟན་དྲོན་ལན་ཚྭས་མ་བཏབ་པ་རང་སངས་རྒྱས་དེ་ལ་ཕུལ་ལོ།
en: “The self-awakened one knew the poor man’s thoughts and held out his bowl, saying, ‘Sir, if you will give it to me, please pour it into this bowl.’ Then, out of strong faith, the boy offered the saltless gruel to the self-awakened one.

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་ཁྱེའུ་བཀྲེན་པ་གང་ཡིན་པ་དེ་ནི་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་འདི་ཉིད་ཡིན་ཏེ།
en: That one who was the poor boy at that time, on that occasion, was indeed this King Prasenajit of Kosala.

source: དེའི་ཚེ་དེའི་དུས་ན་འདིས་རང་སངས་རྒྱས་ལ་ཟན་དྲོན་ལན་ཚྭས་མ་བཏབ་པ་ཕུལ་བ་གང་ཡིན་པའི་ལས་དེས་ན་ལན་དྲུག་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱས་སོ།
en: Because of that karma, namely, his offering the saltless gruel to the self-awakened one at that time, on that occasion, he ruled over the kingdom of the Thirty-Three Gods six times.

source: མཉན་ཡོད་འདི་ཉིད་དུ་ཡང་ལན་དྲུག་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་ཏོ།
en: In this Śrāvastī, too, he has been an anointed kṣatriya king six times.

source: །ལས་ཀྱི་ལྷག་མ་དེ་ཉིད་ཀྱིས་ད་ལྟར་ཡང་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བར་གྱུར་ཏེ།
en: And because of the remains of that karma, he became an anointed kṣatriya king in this life, too.

source: ངས་འདིའི་ཟན་དྲོན་གྱི་རྣམ་པར་སྨིན་པ་རྫོགས་པ་དེ་ལ་དགོངས་ནས།
en: Alluding to the maturation of the karma in which his offering of gruel was completed, I said: “See, it is by the power Of rough, saltless gruel

source: གླང་པོ་རྟ་དང་ཤིང་རྟ་དཔུང་བུ་ཆུང་། །ཞོན་ནས་གྲོང་ཁྱེར་ཡུལ་བཅས་འཁོལ་བྱེད་པ།
en: That he rules the city and country, Going around with elephants, horses, chariots, and infantry.”

source: །སྣུམ་བག་མེད་པའི་མཐུ་ནི་ཡིན་པར་ལྟོས། །ཞེས་གསུངས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ཟན་དྲོན་ལན་ཚྭས་མ་བཏབ་པ་ལས་བརྩམས་ནས་ལས་ཀྱི་རྒྱུ་བ་བཤད་དོ་ཞེས་ཀུན་དུ་སྒྲ་གྲགས་པ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཐོས་ནས།
en: “The Blessed One has revealed the karmic bond related to King Prasenajit of Kosala’s saltless gruel!”

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཞེས་བྱ་བ་ནས།
en: When the king had sat down to one side, the Blessed One, through talk consistent with the Dharma . . . .

source: །དེ་ནས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་བདག་དགུང་ཟླ་བ་གསུམ་དུ་ན་བཟའ་ཆོས་གོས་དང་བསོད་སྙོམས་དང་། སྙུན་གསོས་ཀྱི་རྐྱེན་སྨན་གྱི་ཡོ་བྱད་རྣམས་འབུལ་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: Then King Prasenajit of Kosala rose from his seat, draped his upper robe over one shoulder, knelt on his right knee, made the gesture of supplication to the Blessed One, and said, “May the Blessed One together with the community of monks assent to my offer of the requisites, namely, robes, almsfood, bedding and seats, and medicines for the sick, for three months.” The Blessed One assented to King Prasenajit of Kosala by remaining silent.

source: །དེ་ནས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཟླ་བ་གསུམ་དུ་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་གསོལ་ནས་དགེ་སློང་རེ་རེ་ལ་ཡང་འབུམ་རི་བའི་གོས་རེ་རེ་བསྐོན་ཏེ། འབྲུ་མར་གྱི་བུམ་པ་བྱེ་བ་བསོགས་ནས་མར་མེའི་ཕྲེང་བ་བལྟམ་པར་བརྩམས་སོ།
en: Thereupon King Prasenajit of Kosala began to provide the community of monks headed by the Buddha with meals of a hundred flavors, dress each monk with clothes worth a hundred thousand ordinary clothes, and offer rows of lamps, having gathered ten million bottles of oil, for three months.

source: །དེ་ན་གདུགས་ཚོད་ཀྱི་ཁ་དང་། མཆོད་པའི་ཚེ་ཅ་ཅོའི་སྒྲ་ཆེན་པོ་གྲག་པ་དང་། ཅི་ཙམ་ན་གྲོང་ཉུག་མ་ཤིན་ཏུ་སྡུག་བསྔལ་བ་ཞིག་རྫའི་ཆག་དུམ་ཞིག་ཐོགས་ཏེ་སློང་བ་ལ་ཞུགས་པ་དེས་སྒྲ་ཆེན་པོ་དང་སྒྲ་མཐོན་པོ་ཐོས་སོ།
en: At the time of meals and offerings it was very loud and noisy. D. The Offering of a Lamp by a Beggar Woman Thereupon a certain beggar woman who was long suffering entered the city for alms, carrying a broken oil-vessel.

source: །ཐོས་ནས་ཀྱང་དྲིས་པ། ཤེས་ལྡན་དག་སྒྲ་མཐོན་པོ་དང་སྒྲ་ཆེན་པོ་འདི་ཅི་ཞིག་ཡིན། གཞན་དག་གིས་སྨྲས་པ།
en: When she heard that loud, noisy cry, she asked others, “Sirs, what is this loud, noisy cry?”

source: ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་དུ་གདུགས་ཚོད་གསོལ་ནས་དགེ་སློང་རེ་རེ་ལ་ཡང་འབུམ་རི་བའི་གོས་རེ་རེ་བསྐོན་ཏེ། འབྲུ་མར་གྱི་བུམ་པ་བྱེ་བ་བསོགས་ཏེ་མར་མེའི་ཕྲེང་བ་གཏོང་བར་རྩོམ་པ་ཡིན་ནོ།
en: People told her, “King Prasenajit of Kosala has begun to provide the community of monks headed by the Buddha with meals of a hundred flavors, dress each monk with clothes worth a hundred thousand ordinary clothes, and offer rows of lamps, having gathered ten million bottles of oil, for three months.”

source: །དེ་ནས་གྲོང་ཉུག་མ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་འདི་བསོད་ནམས་ཀྱིས་ངོམས་མི་ཤེས་ནས་ད་དུང་ཡང་སྦྱིན་པ་དག་གཏོང་བསོད་ནམས་དག་བྱེད་ན།
en: The beggar woman thought, “Not content with his other merits, this King Prasenajit of Kosala still makes donations and makes merit today.

source: མ་ལ་བདག་གིས་ཀྱང་འགའ་ཞིག་ལས་བསླངས་ལ་བཅོམ་ལྡན་འདས་ལ་མེ་མར་ཞིག་བལྟམ་མོ་སྙམ་ནས།
en: Now I too will beg for oil from someone and offer a lamp to the Blessed One.”

source: དེས་བསླངས་པའི་འབྲུ་མར་ཉུང་ཟད་སྣོད་གྱོ་རལ་གྱི་ནང་དུ་བླུགས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་འཆག་སའི་སླད་དུ་མར་མེ་བལྟམ་ནས།
en: Having begged and obtained a little oil, she poured it into the vessel and offered a lamp to the Blessed One’s walking path.

source: ཞབས་གཉིས་ལ་གཏུགས་ཏེ་སྨོན་ལམ་བཏབ་པ།
en: Throwing herself at the foot of the walking path, she made this aspiration:

source: དགེ་བའི་རྩ་བ་འདིས་ཇི་ལྟར་སྟོན་པ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འདི་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་འཇིག་རྟེན་དུ་བྱུང་བ་དེ་བཞིན་དུ་བདག་ཀྱང་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་སྟོན་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་ཁོ་ནར་འགྱུར་ཞིང་།
en: “By this root of merit, may I become a teacher named Śākyamuni when people’s lifespans are a hundred years long, just as this teacher, the Blessed One Śākyamuni, appeared when people’s lifespans were a hundred years long.

source: ཡང་ཇི་ལྟར་འདིའི་ཟུང་མཆོག་དང་ཟུང་བཟང་པོ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་དང་། ཉེ་གནས་དགེ་སློང་ཀུན་དགའ་བོ་དང་། ཡབ་ཟས་གཙང་དང་། ཡུམ་ལྷ་མོ་སྒྱུ་འཕྲུལ་ཆེན་མོ་དང་། སྲས་གཞོན་ནུ་སྒྲ་ཅན་ཟིན་བཟང་པོ་དང་། གྲོང་ཁྱེར་སེར་སྐྱའི་གཞི་ལགས་པ་དེ་བཞིན་དུ་བདག་གི་ཡང་ཟུང་མཆོག་དང་ཟུང་བཟང་པོ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་དང་། ཉེ་གནས་དགེ་སློང་ཀུན་དགའ་བོ་དང་། ཡབ་ཟས་གཙང་དང་། ཡུམ་ལྷ་མོ་སྒྱུ་འཕྲུལ་ཆེན་མོ་དང་། སྲས་གཞོན་ནུ་སྒྲ་ཅན་ཟིན་བཟང་པོ་དང་། གྲོང་ཁྱེར་སེར་སྐྱའི་གཞིར་འགྱུར་ཞིང་ཇི་ལྟར་ཡང་བཅོམ་ལྡན་འདས་འདི་སྐུ་གདུང་གསེས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེ་བཞིན་དུ་བདག་ཀྱང་སྐུ་གདུང་གསེས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: And just as his two best and wisest disciples are Śāriputra and Maudgalyāyana, his attendant monk is Ānanda, his father is Śuddhodana, his mother is Queen Mahāmāyā, his son is Prince Rāhulabhadra, and his city is Kapilavastu, so too may my two best and wisest disciples be Śāriputra and Maudgalyāyana, my attendant monk be Ānanda, my father be Śuddhodana, my mother be Queen Mahāmāyā, my son be Prince Rāhulabhadra, and my city be Kapilavastu. And just as this blessed one will be completely emancipated, having his bones distributed, so too may I be completely emancipated, having my bones distributed.”

source: །ཇི་ཙམ་ན་མར་མེ་དེ་དག་ཐམས་ཅད་ནི་ཤིའོ། །དེས་བཏང་བའི་མར་མེ་ནི་འབར་ཞིང་འདུག་གོ།
en: At that time all the other lamps went out, and only the lamp she had lit remained burning.

source: །ཆོས་ཉིད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཇི་སྲིད་ནང་དུ་ཡང་དག་མ་བཞག་པ་དེ་སྲིད་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཉེ་གནས་རྣམས་ནང་དུ་ཡང་དག་མི་འཇོག་པས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བསམས་པ།
en: It is natural that until the buddhas, the blessed ones, retire, the attendants of the buddhas, the blessed ones, do not retire.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འོད་ལ་མནལ་བར་མཛད་པ་དེ་ནི་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་པས་མ་ལ་བདག་གིས་མར་མེ་དེ་གསད་པར་བྱའོ་སྙམ་ནས་དེས་ལག་པས་གསད་པར་བརྩམས་པ་ལས་མ་ནུས་སོ།
en: The venerable Ānanda thought, “It is impossible, out of the question, for the buddhas, the blessed ones, to go to bed in a bright place. I will now extinguish the lamp.” He tried to extinguish the lamp by hand, but in vain.

source: །དེ་ནས་ཆོས་གོས་ཀྱི་གྲྭ་དང་། དེ་ནས་བསིལ་ཡབ་ཀྱིས་གཡབས་ན་འོན་ཀྱང་གསད་པར་མ་ནུས་སོ།
en: Then he tried with the hem of his garment, and then with a fan, but he still was not able to extinguish the lamp.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་འདི་ཅི་བྱེད། དེས་གསོལ་པ།
en: The Blessed One asked the venerable Ānanda, “Ānanda, what are you doing?”

source: བཅོམ་ལྡན་འདས་བདག་གི་གློ་བ་ལ་བསམས་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འོད་ལ་མནལ་བར་མཛད་པ་ནི་གནས་མ་མཆིས་ཤིང་གོ་སྐབས་མ་མཆིས་ཀྱིས།
en: “O Blessed One,” he answered, “I thought, ‘It is impossible, out of the question, for the buddhas, the blessed ones, to go to bed in a bright place.

source: མ་ལ་བདག་གིས་ཞུགས་མར་དགུམ་མོ་སྙམ་ནས་བདག་གིས་དེ་སུག་པས་དགུམ་པར་བརྩམས་ན་རྔོ་མ་ཐོག་གོ།
en: I will now extinguish the lamp.’ I tried to extinguish the lamp by hand, but in vain.

source: །དེ་ནས་ཆོས་གོས་ཀྱི་གྲྭ་དང་། དེ་ནས་བསིལ་ཡབ་ཀྱིས་གཡབས་ན་འོན་ཀྱང་རྔོ་མ་ཐོག་ལགས་སོ།
en: Then I tried with the hem of my garment, and then with a fan, but it still was in vain.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དུབ་པར་མ་བྱེད་ཅིག །གལ་ཏེ་རྣམ་པར་འཐོར་རླུང་ལངས་ན་དེས་ཀྱང་གསད་པར་མི་ནུས་ན་ལག་པ་དང་། ཆོས་གོས་ཀྱི་གྲྭ་དང་། བསིལ་ཡབ་ཀྱིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “Ānanda,” said the Blessed One, “do not waste your effort. Even if a violent storm arose, it could not extinguish that lamp, let alone a hand, the hem of a garment, or a fan.

source: འདི་ལྟར་མར་མེ་འདི་ནི་བུ་མོ་འདིས་སེམས་ཀྱིས་མངོན་པར་འདུ་བྱེད་པ་ཆེན་པོས་བུས་པ་ཡིན་ནོ།
en: That lamp was lit by this girl with a great resolution.

source: །གཞན་ཡང་ཀུན་དགའ་བོ་བུ་མོ་འདི་ནི་སྐྱེ་དགུ་རྣམས་ཀྱི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་ཞིང་དེའི་ཟུང་མཆོག་དང་ཟུང་བཟང་པོ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་དང་། ཉེ་གནས་དགེ་སློང་ཀུན་དགའ་བོ་དང་། ཡབ་ཟས་གཙང་དང་། ཡུམ་ལྷ་མོ་སྒྱུ་འཕྲུལ་ཆེན་མོ་དང་། སྲས་གཞོན་ནུ་སྒྲ་ཅན་ཟིན་བཟང་པོ་དང་གྲོང་ཁྱེར་སེར་སྐྱའི་གཞི་ཞེས་བྱ་བར་འགྱུར་ལ།
en: Ānanda, this girl will become a tathāgata, an arhat, a perfectly awakened one named Śākyamuni when people’s lifespans are a hundred years long, and his two best and wisest disciples will be Śāriputra and Maudgalyāyana, his attendant monk Ānanda, his father Śuddhodana, his mother Queen Mahāmāyā, his son Prince Rāhulabhadra, and his city Kapilavastu.

source: དེ་སྐུ་གདུང་གསེས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: And he will be completely emancipated, having his bones distributed.”

source: །གྲོང་ཉུག་མ་ཆེ་གེ་མོ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ཀྱི་འཆག་སའི་སླད་དུ་མར་མེ་བཏང་བས་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ་ཞེས་ཀུན་དུ་སྒྲ་གྲགས་པ་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་ཅན་རྣམས་ཀྱིས་ཐོས་ནས།
en: There was then a loud shout: “Since the beggar woman So-and-so offered a lamp to the place for the Blessed One’s walking, the Blessed One predicted her supreme and complete awakening!” Having heard this, devout brahmins and householders offered her all the requisites, thinking about her future merit. E. The Question of King Prasenajit: The Offerings Made by the Buddha in His Former Lives

source: དེའི་མ་འོངས་པའི་ཡོན་ཏན་ལ་བསམས་ནས་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྟབས་སོ། །དེ་ནས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཐོས་ནས་དེ་ནས་ངོ་མཚར་སྐྱེས་ཏེ། འབྲུ་མར་བུམ་པ་སྟོང་བསྡོགས་ནས་མར་མེ་སྣ་ཚོགས་སུ་སྦྲེངས་ཏེ་རིན་པོ་ཆེ་སྣ་བཞིའི་མར་མེ་འཆག་སའི་སླད་དུ་བུས་སོ།
en: Having heard this, and prompted by curiosity, King Prasenajit of Kosala prepared a thousand oil vessels, arranged various lamps, and lit lamps made from four different-colored precious materials at the walking path.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སོང་སྟེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་གིས་འཕགས་པ་འོད་སྲུང་ཆེན་པོ་མཆོད་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་དགུང་བདུན་གྱི་བར་དུ་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་སྔོན་གྱི་འཚལ་མ་དྲོན་པོ་ལན་ཚྭས་མ་སྩལ་བ་ལས་བརྩམས་ཏེ་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་ནས།
en: Then he went to the Blessed One and said, “O Honored One, I invited the Blessed One for seven days for the purpose of veneration of the noble one Mahākāśyapa, and the Blessed One revealed the karmic bond related to my saltless gruel in the past.

source: ཡང་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་བདག་གིས་དགུང་ཟླ་གསུམ་དུ་གདུགས་ཚོད་གསོལ་ནས་དགེ་སློང་རེ་རེ་ལ་ཡང་འབུམ་རི་བའི་གོས་ཕྲུགས་རེ་བསྐོན་ཏེ། འབྲུ་མར་བུམ་པ་བྱེ་བ་བསྡོགས་ཏེ་ཕྲེང་བར་སྦྲེངས་ནས་ཞུགས་མར་བལྟམ་ལགས་ན།
en: Further, I have offered meals to the Blessed One together with the community of disciples for three months, dressed each monk with clothes worth a hundred thousand ordinary clothes, and offered rows of lamps, having gathered ten million bottles of oil.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མ་བསྟན་ལགས་ན།
en: But the Blessed One has not predicted my supreme and complete awakening.

source: བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་གཙོ་བོ་འདྲེན་པར་འགྱུར་བར་ལྟ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ན་ལེགས་ལགས་སོ།
en: If I am going to become the best in the world, the leader, too, it would be nice if the Blessed One would predict my supreme and complete awakening.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཟབ་པ། ཟབ་པར་སྣང་བ།
en: “Great King,” replied the Blessed One, “supreme and complete awakening is profound.

source: མཐོང་བར་དཀའ་བ། རྟོགས་པར་དཀའ་བ། བརྟག་པར་བྱ་བ་མ་ཡིན་པ། རྟོག་གེའི་སྤྱོད་ཡུལ་མ་ཡིན་པ། ཞིབ་མོ་བརྟགས་པའི་རྟོགས་པ་དང་། མཁས་པ་དང་མཛངས་པས་རིག་པར་བྱ་བ་ཡིན་ཏེ།
en: It appears profound, it is hard to see or know, it is inconceivable, it is not the object of words, but subtle, and it is to be known only by those of keen perception, the wise, the learned.

source: དེ་ནི་ཁྱེད་ཀྱི་སྦྱིན་པ་ལན་གཅིག་བྱས་པས་ཐོབ་པར་སླ་བ་མ་ཡིན་ཏེ། སྦྱིན་པ་ལན་བརྒྱས་མ་ཡིན། སྦྱིན་པ་ལན་སྟོང་གིས་མ་ཡིན། སྦྱིན་པ་ལན་བརྒྱ་ཕྲག་སྟོང་གིས་མ་ཡིན་ནོ། །འོན་ཀྱང་རྒྱལ་པོ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད་ན་སྦྱིན་པ་དག་ཀྱང་སྦྱིན། བསོད་ནམས་དག་ཀྱང་བྱ་ཞིང་དགེ་བའི་བཤེས་གཉེན་དག་ཀྱང་བསྟེན་པར་བྱ།
en: It is not attained by one donation or a hundred, a thousand, or a hundred thousand donations of yours.

source: བསྙེན་པར་བྱ། བསྙེན་བཀུར་བྱའོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་དེ་བཞིན་དུ་སྦྱིན་པ་དག་ནི་བཏང་། བསོད་ནམས་དག་ནི་བྱས་ཤིང་དགེ་བའི་བཤེས་གཉེན་དག་ཀྱང་བསྟེན། བསྙེན་བསྙེན་བཀུར་བྱས་ན་དེ་ལྟ་ན་ཁྱོད་ནམ་ཞིག་ན་འཇིག་རྟེན་གྱི་གཙོ་བོ་འདྲེན་པར་འགྱུར་གྲང་།
en: But, Great King, if you wish for supreme and complete awakening, you should give donations, make merit, and serve, attend, and wait on good friends. Giving donations, making merit, and serving, attending, and waiting on good friends, you will someday become the best in the world, the leader.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་མཆི་མ་བླགས་ཏེ་ངུས་སོ།
en: Being told this, King Prasenajit of Kosala burst into tears.

source: །དེ་ནས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་གོས་ཀྱི་མཐའ་མས་མཆི་མ་ཕྱིས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བ་ན་སྦྱིན་པ་ནི་ཅི་སྙེད་ཅིག་སྩལ། བསོད་ནམས་ནི་ཇི་སྙེད་ཅིག་བགྱིས་ལགས།
en: Then King Prasenajit of Kosala wiped his tears away with the hem of his garment and asked the Blessed One, “O Honored One, how many donations did the Blessed One give, and how much merit did he make, seeking supreme and complete awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་རེ་ཞིག་འདས་པའི་བསྐལ་པ་གཞན་རྣམས་ལྟ་ཞོག་གི། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བས་རྣམ་གྲངས་དུ་མར་སྦྱིན་པ་བཏང་བ་དང་། བསོད་ནམས་བྱས་པ་དེ་དག་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཟུང་ཤིག་དང་བཤད་དོ།། །།བར་སྡོམ་ལ།
en: “Great King,” replied the Blessed One, “leaving other past eons aside for now, I gave donations and made merit in various ways, seeking supreme and complete awakening in this fortunate eon. Listen to those stories well and keep them in mind; I shall teach them.” F. Former Life Stories I Internal Summary of Contents:

source: ང་ལས་ནུ་དང་ལེགས་མཐོང་ཆེ།
en: Māndhātṛ, Mahāsudarśana,

source: །དུས་དཔོག་ཀུ་ཤ་གདོལ་བ་དང་། །ལྷ་ཆེན་པོ་དང་མུ་ཁྱུད་རྒྱལ།
en: Velāma, Kuśa, Triśaṅku, Mahādeva, King Nimi,

source: །མེ་ལོང་གདོང་དང་ནོར་བཟངས་དང་། །ཐམས་ཅད་སྒྲོལ་དང་འདུམ་བྱེད་དོ།
en: Ādarśamukha, Sudhana, Viśvantara, and Saṃdhāna. 1.

source: །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་སྐྱེ་དགུ་རྣམས་ཀྱི་ཚེ་ལོ་དཔག་ཏུ་མེད་པ་ན་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏེ།
en: Māndhātṛ a. The Story of King Māndhātṛ “Great King, once, when people’s lives were immeasurably long, there appeared a king named Upoṣadha.

source: དེའི་སྤྱི་བོར་ཤ་རྨེན་འཇམ་ཞིང་ཤིན་ཏུ་འཇམ་པ་ཞིག་སྐྱེས་པ་དཔེར་ན་ཤིང་བལ་གྱི་འདའ་བ་འམ།
en: One day a soft, fleshy tumor developed on the crown of his head;

source: རས་བལ་གྱི་འདའ་བ་ལྟ་བུར་གནོད་པ་ཅུང་ཟད་ཀྱང་མི་སྐྱེད་དོ། །དེ་ཡོངས་སུ་སྨིན་ནས་རྡོལ་བ་ལས་གཞོན་ནུ་གཟུགས་བཟང་པོ་མཛེས་པ། བལྟ་ན་སྡུག་པ། པགས་པའི་མདོག་གསེར་འདྲ་བ། མགོ་གདུགས་ལྟར་འདུག་པ། ལག་པ་རིང་བ།
en: it was exceptionally soft, just like tūla cotton or karpāsa cotton, and caused no pain. When it had fully enlarged, it burst open and a boy emerged from it.
